{
  "contactDetails": {
    "title": "Contact details",
    "fullName": "Gianluca Agnocchetti",
    "jobRole": "Senior full stack web developer",
    "homeAddress": {
      "road": "16, Tennyson Road",
      "postCode": "AL2 3HY",
      "town": "St. Albans",
      "county": "Hertfordshire",
      "country": "UK"
    },
    "phoneNumber": [
      "+44 7426 713188"
    ],
    "email": [
      "gianluca.agnocchetti@gmail.com"
    ],
    "web": [
      "http://gianluca.co.nf",
      "http://gnlc.me"
    ],
    "social": [
      "http://www.facebook.com/iamgnlc",
      "http://linkedin.com/in/iamgnlc",
      "http://twitter.com/iamgnlc",
      "http://soundcloud.com/hiryu"
    ]
  },
  "profile": {
    "title": "Profile",
    "description": "Senior developer with over 15 years track record of delivering complex, high value, scalable web sites/applications, custom data tracking and analysis solutions, and quick problem solving. Passionate about coding and always up to date about latest technology, focused on performance and security, to implement the optimal solution. Generous in sharing technical knowledge with the team, and always opened to a different point of view. Keen to spend time learning and improving my skill at 360 round."
  },
  "keyAttributes": {
    "title": "Key attributes and skills",
    "paragraphs": [
      {
        "title": "Front end &amp; Back end",
        "list": [
          "Excellent knowledge of <b>PHP 4, 5 and 7</b> programming language, procedural and OOP. Over 15 years of experience, with a deep passion for coding, I have developed dynamic web sites and web applications, from scratch and/or using CMSes or frameworks. Superb understanding in interfacing and optimizing applications with <b>MySQL</b>, <b>MS SQL Server</b>, <b>Postgres</b>, <b>mongoDB</b> databases or <b>XML</b> datasets, and also, third party <b>SOAP</b> or <b>REST</b> APIs.",
          "Excellent knowledge of <b>HTML/XHTML</b>, <b>CSS3/LESS/SASS</b>, <b>AJAX</b> and <b>Javascript</b> scripting language. Deep knowledge of <b>jQuery</b> library and <b>DOM</b> manipulation.",
          "Very good knowledge of templating system like <b>Pug/Jade</b> and <b>HAML</b>.",
          "Good knowledge of <b>XML</b> meta language, using in conjunction with <b>Xpath</b> technology for querying big files, validation against <b>XSD</b> schema and <b>XSL</b> template system.",
          "Design and development of adaptive and responsive table-less front end pixel precision layouts and clear and dynamic user interfaces, for the best possible user experience, using <b>960.gs</b>, <b>Twitter Bootstrap</b>, <b>Skeleton</b>, <b>ZURB Foundation</b>, <b>Pure</b> and many other frameworks.",
          "Extensive knowledge of <b>React.js</b>, <b>Node.js</b> and MVC framework <b>Sails.js</b>.",
          "Exposure to <b>React Native</b> mobile development.",
          "Good knowledge of <b>Foundation for Email</b> framework, for responsive and maximum compatibility email creation.",
          "Good exposure to <b>Gulp</b> and <b>Webpack</b> task automation tools, <b>Yarn</b> and <b>NPM</b>",
          "Good knowledge of high traffic web sites page load optimization techniques (<b>HTML / JS / CSS minification</b>, images optimization, <b>CDN</b> integration, caching methods) and web server tuning for an optimal performance.",
          "Good knowledge of <b>classic ASP</b> programming language."
        ]
      },
      {
        "title": "CMS/Framework and RESTful APIs integration",
        "list": [
          "Good knowledge of <b>Amazon Web Services</b> usage and integration with major CMS and API programming via PHP, for scheduling or automate operations.",
          "Good knowledge of MVC paradigm and best practices and reusable code for software development. Usage of custom frameworks and SDK and <b>Laravel/Lumen</b> PHP framework. Good knowledge of <b>Ruby and Ruby On Rails</b> framework.",
          "Excellent knowledge of <b>Drupal</b> CMS. Complete website setup with extreme customization, themes and custom modules creation, core and third party APIs, speed and code optimization, usage of main and third party modules, schedule of complete backup (via Drush) and most common operations.",
          "Good knowledge of <b>Wordpress</b> CMS, installation, environment set-up, usage and customization with plugin and theme development, integration with external CRM via APIs.",
          "Good experience in platform development via <b>RESTful APIs</b>. Custom development using <b>GoToWebinar, Lyris, AWS</b> and other major platforms APIs, integration with Drupal or Wordpress CMS system.",
          "Basic knowledge (installation, configuration and usage) of major e-commerce web applications like, <b>Joomla / VirtueMart, osCommerce, Magento, ZenCart</b> with a strong background experience in data import/export and migration between different systems."
        ]
      },
      {
        "title": "Database",
        "list": [
          "Excellent knowledge of <b>SQL</b> language: Over 15 years of experience in writing, designing, editing and optimizing basic and complex queries and procedures on <b>MySQL, Postgres</b> and <b>MS SQL Server</b>, integrated with PHP, Ruby or ASP programming, through handwriting code and design GUIs.",
          "Excellent knowledge of <b>RDBMS</b> (Relational database management system): In conjunction with programming, I have developed, designed and maintained many relational DBs (MySQL, Postgres, MS SQL, MS Access) with server maintenance, backup, optimization, and data cleansing.",
          "Excellent knowledge of <b>SQL-Injection</b> techniques and how to prevent this kind of attack.",
          "Good knowledge of <b>mongoDB</b> NoSQL database and its fields of application in web sites / web app development.",
          "Good knowledge of database administration techniques and major tools for data import/export, backup and restore, application installation, permission configuration, master/slave replication, tuning and optimization, in both Windows and Linux environment, even with command shell."
        ]
      },
      {
        "title": "Environments and Operating Systems",
        "list": [
          "Very comfortable with <b>MS-DOS, Linux</b> and <b>Mac OS</b> shell command line, batch procedures creation for automation and service configuration without GUI, and good knowledge of <b>SSH</b> shell, included <b>SSHFS</b> volume mounting, SSH tunneling, and Telnet shell.",
          "Over 15 years of experience with <b>MS Windows systems</b>, from the old Windows 95 to the new Windows 7 and Windows 2003 / 2008 / 2011 Server, passing through Windows NT / 98 / ME / 2000 / XP / Vista / 7. Installation, configuration, maintenance and tuning for personal use and intranet. Quite strong skills in <b>MS Windows Server edition</b>, like services configuration, user permissions, operations scheduling (<b>MS Task Scheduler, CRON</b>), data recovery from various file systems (<b>FAT, NTFS, HFS</b>), system optimization, data backup over network with personalized and self-developed applications.",
          "Excellent knowledge of Apple <b>Mac OS</b> systems (Tiger, Leopard, Snow Leopard, Lion, Mountain Lion, Mavericks), connection over network and interfacing with different systems (Windows, Linux), and gained experience using them for professional use in graphic and audio editing and creation.",
          "Good knowledge of <b>Raspberry PI</b> system and it's configuration. Used for my personal custom projects like tiny portable web server, VPN home server, TV media center etc.",
          "Very comfortable with <b>LAMP</b> platform (and the equivalents <b>WAMP</b> for Windows platforms and <b>MAMP</b> for Mac OS platform), installation and configuration in test and production environment, with an eye to the security policies and different users permissions.",
          "Very comfortable with <b>Linux</b> systems (major distributions like Debian, CentOS, Ubuntu) with GUI or via console, OS installation, virtualized or native, installation and configuration of major web services (<b>Apache, Nginx, PHP, MySQL, ProFTP / VsFTP</b>), networking for remote access, cron tasks for scheduled operations, iptables rules, users management.",
          "High traffic web sites optimization and low level server integration experience. Installation and configuration of the major web accelerators and cache systems like <b>APC</b> and <b>Memcache</b>, reverse proxy like <b>Varnish</b>, and scalable search environment like <b>Apache Solr</b>.",
          "Very comfortable with cloud servers (<b>Amazon EC2, RDS, CloudFront, Elasticache</b>), creation, configuration and management via SSH and web console.",
          "Good knowledge of OSes virtualization (Windows, Linux and Mac OS platform) using <b>VMWare, VirtualBox, Parallels Desktop</b>, and configuration of host and guest machine for the better performance, communication over network, automatic snapshot creation.",
          "Good knowledge of mobile OSes like <b>iOS, Android, Windows Mobile / Phone, Symbian</b> for a perfect user experience.",
          "Good knowledge of benchmark techniques, scalability and web pages optimization for an improved performance on high traffic web sites, usage of multiple servers to balance the load, and resource monitoring.",
          "Good knowledge of <b>Vagrant</b> virtual development environments manager, and it's related web GUI <b>PuPHPet</b>.",
          "Good knowledge of <b>Git</b> version control system.",
          "Basic knowledge of <b>MVS/ESA TSO</b> environment."
        ]
      },
      {
        "title": "Networking, Protocols and Hardware in general",
        "list": [
          "Strong skills in server installation, configuration, tuning and maintenance such as web server (<b>Apache, IIS</b>), ftp server (<b>FileZilla Server</b>), terminal server (<b>VNC, RDP</b>), mail server (<b>SMTP, POP, IMAP</b>), virtual private network (<b>VPN</b>).",
          "Very comfortable with cloud computing and all the major cloud services (Box.net, Dropbox, Google Drive, etc.) with web integration, document sharing and backup.",
          "Good knowledge of network protocols and their configuration (<b>Ethernet, TCP, FTP, HTTP, HTTPS, POP, SMTP</b>) and network setup (<b>port forwarding, wireless setup, DHCP reservation, MAC filter, etc.</b>), with little practice of hardware assembly and performances optimization, network setup and hardware configuration (access point, hub, bridge, router, NAS).",
          "Good knowledge of <b>VOIP</b> protocol and its configuration on mobile and local intranet.",
          "Analysing, diagnosing, installation, and resolution of complex desktop computer, operating system, application software and hardware technologies and associated problems."
        ]
      },
      {
        "title": "Office, Graphic, Audio and General Media",
        "list": [
          "Advanced knowledge of principal office suites like <b>OpenOffice, MS Office</b>, with good skills in <b>VBA scripting</b> for Excel for procedures automation and data recovery from broken archives or documents (.PST, .XLS, .DOC, .MDB, .ODT).",
          "Good feeling in producing of technical documentation (flow charts, database design and relations) for the projects I’m working on.",
          "Very good knowledge of graphic applications (<b>PhotoShop, Illustrator, Corel DRAW, The Gimp</b>) and digital graphic techniques (layers, masks, etc.) using vector and raster graphic, for print or web usage, front office and back office interfaces realization, flyer, brochure and logo design.",
          "Very good knowledge about audio processing techniques and professional program usage like <b>Apple Logic Pro, Adobe Audition, Ableton Live</b>, for cutting, mixing, filtering, compressing, rewiring techniques between DAW, interfacing external audio equipment with PC/Mac, and strong audio production for web or professional show usage."
        ]
      },
      {
        "title": "Business Intelligence",
        "list": [
          "Good knowledge of <b>Jasper Suite</b>, Windows / Linux server installation, Studio to design and deploy reports, and integration with major data container systems.",
          "Over 5 years of experience in development of complex <b>SQL</b> statements and procedures for data aggregation and easy readability.",
          "Experienced in planning and development of custom systems using live data or normalized DBs and generate custom and on-demand reports."
        ]
      },
      {
        "title": "Personal Attitudes",
        "list": [
          "As an Agile developer, I take responsibility for planning, estimating and managing tasks. Collaborating closely with members of the team to take shared responsibility for the overall efforts that the team has committed to.",
          "Fast learner, open-minded and always updated about latest technologies in web development.",
          "Security focused.",
          "Good attitude to team working and team leading, and open to any confrontation to reach the best solution.",
          "Works independently with no direct supervision in analysis, design, and implementation of database, application, user interface and documentation during all the development process.",
          "Strong creativity and initiative to problem catching and solving.",
          "Very well in mentoring junior developers, sharing my knowledge and analysing source code and help them to find any error in the code.",
          "Curious and passionate about technology.",
          "Good communications and interpersonal skills.",
          "Experienced in B2B / B2C commercial environment.",
          "Great attention to detail."
        ]
      },
      {
        "title": "Artistic Skills",
        "list": [
          "Very good computer skills in raster/vector images handling.",
          "Excellent knowledge and skills in the use of audio, video and light mixers, and professional hi-fi equipment for shows, ballets, parties, exhibitions etc.",
          "Excellent knowledge of computer audio creation, processing, and mixing techniques.",
          "Creation of 2 mini-albums and other single tracks, produced entirely with computer, mixing, sampling and covers, available for free download on the web."
        ]
      },
      {
        "title": "Social Skills",
        "list": [
          "Over 10 years experience in office environments gave me the chance to gain skills in business communication methods and job optimization.",
          "I played as DJ in bar, disco, holiday villages and amusement parks, in contact with people from all around the world; this gave me the opportunity to confront myself with other kind of cultures."
        ]
      }
    ]
  },
  "spokenLanguages": {
    "title": "Spoken languages",
    "headRow": [
      "Italian<br/><small>(Mother language)</small>",
      "English",
      "Technical English<br/><small>(Electronic and IT focused)</small>"
    ],
    "headCol": [
      "Reading",
      "Writing",
      "Verbal"
    ],
    "table": {
      "itRead": "Excellent",
      "itWrite": "Excellent",
      "itVerb": "Excellent",
      "enRead": "Fluent",
      "enWrite": "Fluent",
      "enVerb": "Fluent",
      "tenRead": "Fluent",
      "tenWrite": "Fluent",
      "tenVerb": "Fluent"
    }
  },
  "personalInfo": {
    "title": "Personal informations",
    "dob": "February 18<sup>th</sup> 1980",
    "gender": "Male",
    "drivingLicence": "Full and clean",
    "nationality": "Italian",
    "workPermit": "Unlimited as EU citizen",
    "nino": "SN 47 81 35 D"
  },
  "activities": {
    "title": "Activities and interests",
    "description": "During my spare time I enjoy relaxing and going out with friends. I also enjoy cooking and listening and collecting old vinyls, but my primary interest is music production. I love to spend my free time to create original tracks or remixing famous songs, using various devices, and keep them in tempo sync for a unique and original mixdown. Also, I love to keep myself updated about latest professional audio software and techniques."
  }
}